[
    {
        "id": 1,
        "name": "TOOLS HOUSE",
        "project": "Project No-1",
        "features": "A wonderful home page with responsive navbar, banner carousel, realistic footer. Create a wonderful payment system. Dashboard is available. Nice backend system created by NodeJS, ExpressJs. ",
        "live": "https://tools-house-155bc.web.app/",
        "clientCode": "https://github.com/Mejbah-ul-haque/tools-house-client",
        "serverCode": "https://github.com/Mejbah-ul-haque/tools-house-server",
        "bodyPart1": "Have beautiful Dashboard. Are you going to Dashboard you have to login with yor email. You can also login with your google account. Total two Firebase authentication implemented.  Password verification password reset option also added. ",
        "bodyPart2": "Admin can added product any time. He creates a new user and make a admin. Password verification password reset option also added.",
        "bodyPart3": "Full responsive with navigation. Used Route, Private route, Dynamic route. use environment variable for password secret. Use gitignore file.",
        "bodyPart4": "What a fantastic (404) Not found page with a fenny picture. Show error message.",
        "technologies": "React.js, Express.js, CSS3, Tailwind CSS,DaisyUI, Mongodb, Heroku, Firebase.",
        "tools": "VS Code, React hook form, React Query, Spripe, Font Awesome, JWT Token etc.",
        "image": "https://i.ibb.co/HVFjwhL/tools1.jpg",
        "image2": "https://i.ibb.co/dGjDr3z/tools2.jpg",
        "image3": "https://i.ibb.co/18wwxYT/tools3.jpg",
        "image4": "https://i.ibb.co/pvFzKk2/tools4.jpg"
    },      
    {
        "id": 2,
        "name": "ATAFAL WAREHOUSE",
        "project": "Project No-2",
        "features": "It is warehouse management website. A wonderful home page with responsive navbar, banner carousel, realistic footer.  Nice backend system created by NodeJS, ExpressJs",
        "live": "https://atafal-warehouse.web.app/",
        "clientCode": "https://github.com/Mejbah-ul-haque/atafal-warehouse-client",
        "serverCode": "https://github.com/Mejbah-ul-haque/atafal-warehouse-server",
        "bodyPart1": "Total two Firebase authentication implemented. Such as Email-password, Google Sign In. Password verification password reset option also added. ",
        "bodyPart2": "Full responsive with navigation. Used Route, Private route, Dynamic route. User can added new product and also deleted any product.",
        "bodyPart3": " use environment variable for password secret. Use gitignore file.",
        "bodyPart4": "What a fantastic (404) Not found page with a fenny picture. Show error message.",
        "technologies": "React.js, Express.js, CSS3, Bootstrap, React-Bootstrap, Mongodb, Heroku, Firebase.",
        "tools": "VS Code, React hook form, Font Awesome, JWT Token, React Toastify etc.",
        "image": "https://i.ibb.co/930Vjy7/atafal1.jpg",
        "image2": "https://i.ibb.co/ySTmT01/atafal2.jpg",
        "image3": "https://i.ibb.co/zJG8zb2/atafal3.jpg",
        "image4": "https://i.ibb.co/GMwvKmR/atafal4.jpg"
    },
    {
        "id": 3,
        "name": "THE CRICKE",
        "project": "Project No-3",
        "features": "A beautiful Cricket website. It's totally based on Cricket. A wonderful home page with responsive navbar, banner carousel, realistic footer. Each button has been made attractive so that it is easily visible to everyone.",
        "live": "https://superb-hummingbird-9a51f4.netlify.app/",
        "clientCode": "https://github.com/Mejbah-ul-haque/cricket_update",
        "serverCode": "https://github.com/Mejbah-ul-haque/cricket_update",
        "bodyPart1": "The biggest feature of this website is that it is very clean and tidy. This is a news portal. Made only by News Base. I hope readers will enjoy reading the news on such websites. Each section is highlighted with great headlines. So readers can understand what has been discussed here by looking at each section. ",
        "bodyPart2": "The category pages of The Cricket website have been amazing to look at. Some great buttons have been used. If the reader wants, he can go to the new page by clicking on that button.",
        "bodyPart3": "There is another surprise on the landing page. Here, on the one hand, you can find the news deadlines, on the other hand, you can also see the headlines of the best news of the day.",
        "bodyPart4": "There is a lot of work in the footer section. Here is the link to the social media. There will also be more useful links.",
        "technologies": "HTML5, CSS3, Bootstrap, No JavaScript, No NodeJS or ExpressJS",
        "tools": "VS Code, Font Awesome, Google Font",
        "image": "https://i.ibb.co/02BZM8Q/cricket1.jpg",
        "image2": "https://i.ibb.co/VxnMVbj/cricket2.jpg",
        "image3": "https://i.ibb.co/FqLK9PX/cricket3.jpg",
        "image4": "https://i.ibb.co/Y7FQbc3/cricket4.jpg"
    }
]